In [1]:
import pandas as pd

In [2]:
nombres= ["Andrea","Brandon","Cesar","Carlos"]
profesiones = ["Arquitecta","Estadístico","Administrador","Ingeniero de Sistemas"]
edad = [25, 30, 32, 28]
distrito = ["Lince", "Miraflores", "Jesús María", "Surco"]

In [3]:
datos = {"nombres": nombres,
        "profesión": profesiones,
        "edades": edad,
        "distrito": distrito}

In [4]:
df = pd.DataFrame(datos)

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   nombres    4 non-null      object
 1   profesión  4 non-null      object
 2   edades     4 non-null      int64
 3   distrito   4 non-null      object
dtypes: int64(1), object(3)
memory usage: 256.0+ bytes

In [6]:
df.head()

   nombres              profesión  edades     distrito
0   Andrea             Arquitecta      25        Lince
1  Brandon            Estadístico      30   Miraflores
2    Cesar          Administrador      32  Jesús María
3   Carlos  Ingeniero de Sistemas      28        Surco

In [8]:
len(df)

4

In [10]:
#cúantas variables tenemos en nuestro df
len(df.columns)

4

In [12]:
#cuántos registros tenemos en nuestro df
len(df.index)

4

**Transformar a lista las etiquetas de columna**

In [ ]:
#algunas funciones en python requieren en sus parámetros que se ingresen las etiquetas de variables

In [15]:
list(df.columns)

['nombres', 'profesión', 'edades', 'distrito']

In [16]:
df.columns.tolist()

['nombres', 'profesión', 'edades', 'distrito']

In [ ]:
#porque existen librerías como h2o, por ejemplo, que requiere ingresar las etiquetas de las columnas del df

**Extraer valores por etiqueta**

In [24]:
#existen funciones que solicita se ingresen los valores de variables
df["edades"].values

array([25, 30, 32, 28], dtype=int64)

**Extraer valores por posición**

In [26]:
df.iloc[:,0:3].values

array([['Andrea', 'Arquitecta', 25],
       ['Brandon', 'Estadístico', 30],
       ['Cesar', 'Administrador', 32],
       ['Carlos', 'Ingeniero de Sistemas', 28]], dtype=object)

**Selección de columnas por posición**

In [27]:
df.iloc[:,0:3]

   nombres              profesión  edades
0   Andrea             Arquitecta      25
1  Brandon            Estadístico      30
2    Cesar          Administrador      32
3   Carlos  Ingeniero de Sistemas      28

In [29]:
df.iloc[:,[0,2]]

   nombres  edades
0   Andrea      25
1  Brandon      30
2    Cesar      32
3   Carlos      28

**Selección de columnas por etiqueta**

In [43]:
df[["nombres","profesión"]].values

array([['Andrea', 'Arquitecta'],
       ['Brandon', 'Estadístico'],
       ['Cesar', 'Administrador'],
       ['Carlos', 'Ingeniero de Sistemas']], dtype=object)

In [42]:
df.loc[:,"edades"].values

array([25, 30, 32, 28], dtype=int64)

**Selección de filas**

iloc

In [30]:
df.iloc[0:2,[0,2]]

   nombres  edades
0   Andrea      25
1  Brandon      30

**Filtros**

In [37]:
df[(df.profesión=="Estadístico") & (df.edades>=30)]

   nombres    profesión  edades    distrito
1  Brandon  Estadístico      30  Miraflores

In [51]:
df_copia = df.copy()
#copy(): tipeado dinámico

In [46]:
df_copia.drop("distrito",
             axis=1,
             inplace=False)

#axis toma dos valores
#axis=1 cuando la función va operar por columna
#axis=0 cuando la función va operar por fila

   nombres              profesión  edades
0   Andrea             Arquitecta      25
1  Brandon            Estadístico      30
2    Cesar          Administrador      32
3   Carlos  Ingeniero de Sistemas      28

In [48]:
df_copia.drop("distrito",
             axis=1,
             inplace=True)

In [50]:
df_copia.drop([0],
             axis=0,
             inplace=False)

   nombres              profesión  edades
1  Brandon            Estadístico      30
2    Cesar          Administrador      32
3   Carlos  Ingeniero de Sistemas      28

In [49]:
df_copia

   nombres              profesión  edades
0   Andrea             Arquitecta      25
1  Brandon            Estadístico      30
2    Cesar          Administrador      32
3   Carlos  Ingeniero de Sistemas      28

In [52]:
df_copia

   nombres              profesión  edades     distrito
0   Andrea             Arquitecta      25        Lince
1  Brandon            Estadístico      30   Miraflores
2    Cesar          Administrador      32  Jesús María
3   Carlos  Ingeniero de Sistemas      28        Surco

In [56]:
df_copia.drop("distrito",
             axis=1,
             inplace=False)

   nombres              profesión  edades
0   Andrea             Arquitecta      25
1  Brandon            Estadístico      30
2    Cesar          Administrador      32
3   Carlos  Ingeniero de Sistemas      28

In [57]:
df_copia

   nombres              profesión  edades     distrito
0   Andrea             Arquitecta      25        Lince
1  Brandon            Estadístico      30   Miraflores
2    Cesar          Administrador      32  Jesús María
3   Carlos  Ingeniero de Sistemas      28        Surco

In [58]:
df_copia.drop("distrito",
             axis=1,
             inplace=True)

In [59]:
df_copia

   nombres              profesión  edades
0   Andrea             Arquitecta      25
1  Brandon            Estadístico      30
2    Cesar          Administrador      32
3   Carlos  Ingeniero de Sistemas      28

In [60]:
df_copia[df_copia.nombres!="Cesar"]

   nombres              profesión  edades
0   Andrea             Arquitecta      25
1  Brandon            Estadístico      30
3   Carlos  Ingeniero de Sistemas      28

In [61]:
df_copia.edades.min()

25

In [62]:
df_copia.edades.max()

32

In [65]:
df_copia.iloc[0,2]=27

In [66]:
df_copia

   nombres              profesión  edades
0   Andrea             Arquitecta      27
1  Brandon            Estadístico      30
2    Cesar          Administrador      32
3   Carlos  Ingeniero de Sistemas      28

**Importación de ficheros**

In [76]:
import json5
import json #importación de ficheros json
import pandas as pd #varios tipos de importación, por ejemplo csv
import xlrd #importar ficheros de excel
import pyreadstat #importar ficheros de spss
import numpy as np #operaciones
import os #cuenta con funciones para consultar o modificar el directorio de trabajo

In [78]:
os.chdir("D:/Python/1. Nivel I/3/datos")

In [79]:
os.getcwd()

'D:\\Python\\1. Nivel I\\3\\datos'

**JSON**

In [80]:
#subvenciones.json
with open("subvenciones.json", encoding="utf-8") as fichero:
    datos = json.load(fichero)

In [81]:
type(datos)

list

In [83]:
type(datos[0])

dict

In [84]:
datos

[{'Asociación': 'AMPA ANTONIO MACHADO',
  'Actividad Subvencionada': 'TALLER FIESTA DE CARNAVAL',
  'Importe en euros': '94.56'},
 {'Asociación': 'AMPA ANTONIO MACHADO',
  'Actividad Subvencionada': 'TALLER DIA DEL PADRE',
  'Importe en euros': '39.04 '},
 {'Asociación': 'AMPA ANTONIO MACHADO',
  'Actividad Subvencionada': 'TALLER DIA DE LA MADRE',
  'Importe en euros': '43.64 '},
 {'Asociación': 'AMPA ANTONIO MACHADO',
  'Actividad Subvencionada': 'FIESTA FIN DE CURSO',
  'Importe en euros': '921.00 '},
 {'Asociación': 'AMPA ANTONIO MACHADO',
  'Actividad Subvencionada': 'CONCURSO LOGOTIPO AMPA',
  'Importe en euros': '56.57 '},
 {'Asociación': 'AMPA ANTONIO MACHADO',
  'Actividad Subvencionada': 'ASOCIACION FAPA ALCOBENDAS',
  'Importe en euros': '80.00 '},
 {'Asociación': 'AMPA ANTONIO MACHADO',
  'Actividad Subvencionada': 'ASOCIACION FAPA GINER DE LOS RIOS',
  'Importe en euros': '86.79 '},
 {'Asociación': 'AMPA ANTONIO MACHADO',
  'Actividad Subvencionada': 'FIESTA DE NAVIDAD',
  'Importe en euros': '660.00 '},
 {'Asociación': 'AMPA ANTONIO MACHADO',
  'Actividad Subvencionada': 'HALLOWEEN',
  'Importe en euros': '168.39 '},
 {'Asociación': 'AMPA ANTONIO MACHADO',
  'Actividad Subvencionada': 'SAN ISIDRO',
  'Importe en euros': '195.00 '},
 {'Asociación': 'AMPA BACHILLER ALONSO LOPEZ',
  'Actividad Subvencionada': 'MATEMATICAS MANIPULATIVAS',
  'Importe en euros': '480.00 '},
 {'Asociación': 'AMPA BACHILLER ALONSO LOPEZ',
  'Actividad Subvencionada': 'PROYECTO DE INGLES',
  'Importe en euros': '480.00 '},
 {'Asociación': 'AMPA BACHILLER ALONSO LOPEZ',
  'Actividad Subvencionada': 'EXCURSIONES PRIMARIA',
  'Importe en euros': '928.00 '},
 {'Asociación': 'AMPA BACHILLER ALONSO LOPEZ',
  'Actividad Subvencionada': 'GRADUACIÓN INFANTIL',
  'Importe en euros': '360.00 '},
 {'Asociación': 'AMPA BACHILLER ALONSO LOPEZ',
  'Actividad Subvencionada': 'GRADUACIÓN 6 PRIM',
  'Importe en euros': '240.00 '},
 {'Asociación': 'AMPA BACHILLER ALONSO LOPEZ',
  'Actividad Subvencionada': 'REVISTA COLEGIO ENTRETIZAS',
  'Importe en euros': '220.00 '},
 {'Asociación': 'AMPA BACHILLER ALONSO LOPEZ',
  'Actividad Subvencionada': 'FIESTA INTERCULTURAL',
  'Importe en euros': '492.00 '},
 {'Asociación': 'AMPA CASTILLA',
  'Actividad Subvencionada': 'CONCURSO TARJETAS NAVIDEÑAS',
  'Importe en euros': '124.00 '},
 {'Asociación': 'AMPA CASTILLA',
  'Actividad Subvencionada': 'TALLER COMO MEJORAR LA AUTOESTIMA DE NUESTROS HIJOS',
  'Importe en euros': '160.00 '},
 {'Asociación': 'AMPA CASTILLA',
  'Actividad Subvencionada': 'FIESTA FIN DE CURSO',
  'Importe en euros': '840.00 '},
 {'Asociación': 'AMPA CASTILLA',
  'Actividad Subvencionada': 'PROPUESTA DE ACTIV EXTRAESCOLARES,INSCRIPCIONES. INTERCAMBIO LIBROS',
  'Importe en euros': '150.00'},
 {'Asociación': 'AMPA CASTILLA',
  'Actividad Subvencionada': 'FEDERACION',
  'Importe en euros': '64.00 '},
 {'Asociación': 'AMPA CASTILLA',
  'Actividad Subvencionada': 'FIESTA REYES MAGOS',
  'Importe en euros': '460.00 '},
 {'Asociación': 'AMPA CASTILLA',
  'Actividad Subvencionada': 'CHOCOLATADA',
  'Importe en euros': '336.00 '},
 {'Asociación': 'AMPA CASTILLA',
  'Actividad Subvencionada': 'SAN ISIDRO',
  'Importe en euros': '163.00 '},
 {'Asociación': 'AMPA CASTILLA',
  'Actividad Subvencionada': 'HALLOWEEN',
  'Importe en euros': '160.00 '},
 {'Asociación': 'AMPA CASTILLA',
  'Actividad Subvencionada': 'CARNAVAL EN LA AULAS',
  'Importe en euros': '147.44 '},
 {'Asociación': 'AMPA DAOIZ Y VELARDE',
  'Actividad Subvencionada': 'PLAN LECTOR',
  'Importe en euros': '370.00 '},
 {'Asociación': 'AMPA DAOIZ Y VELARDE',
  'Actividad Subvencionada': 'CONCIERTO MUSICA DIVERTIDA',
  'Importe en euros': '575.74 '},
 {'Asociación': 'AMPA DAOIZ Y VELARDE',
  'Actividad Subvencionada': 'TALLER HABILIDADES SOCIALES O TECNICAS DE ESTUDIO',
  'Importe en euros': '220.00 '},
 {'Asociación': 'AMPA DAOIZ Y VELARDE',
  'Actividad Subvencionada': 'FIESTA FIN DE CURSO',
  'Importe en euros': '600.00 '},
 {'Asociación': 'AMPA DAOIZ Y VELARDE',
  'Actividad Subvencionada': 'GRADUACIONES INFANTIL Y SEXTO',
  'Importe en euros': '160.00 '},
 {'Asociación': 'AMPA DAOIZ Y VELARDE',
  'Actividad Subvencionada': 'AGENDAS',
  'Importe en euros': '340.00 '},
 {'Asociación': 'AMPA DAOIZ Y VELARDE',
  'Actividad Subvencionada': 'EXPOSICION FOTOGRAFICA',
  'Importe en euros': '198.00 '},
 {'Asociación': 'AMPA DAOIZ Y VELARDE',
  'Actividad Subvencionada': 'NAVIDAD',
  'Importe en euros': '689.00 '},
 {'Asociación': 'AMPA EMILIO CASADO',
  'Actividad Subvencionada': 'DIA DE LA MUSICA',
  'Importe en euros': '295.67 '},
 {'Asociación': 'AMPA EMILIO CASADO',
  'Actividad Subvencionada': 'SALIDA CULTURAL AL TEATRO',
  'Importe en euros': '196.00 '},
 {'Asociación': 'AMPA EMILIO CASADO',
  'Actividad Subvencionada': 'FESTIVAL FIN DE CURSO',
  'Importe en euros': '247.00 '},
 {'Asociación': 'AMPA EMILIO CASADO',
  'Actividad Subvencionada': 'FIESTA FIN DE CURSO',
  'Importe en euros': '1.000.00 '},
 {'Asociación': 'AMPA EMILIO CASADO',
  'Actividad Subvencionada': 'ASOCIACION FAPA GINER DE LOS RIOS',
  'Importe en euros': '175.00 '},
 {'Asociación': 'AMPA EMILIO CASADO',
  'Actividad Subvencionada': 'ASOCIACION FAPA ALCOBENDAS',
  'Importe en euros': '77.00 '},
 {'Asociación': 'AMPA EMILIO CASADO',
  'Actividad Subvencionada': 'FIESTA NAVIDAD',
  'Importe en euros': '850.00 '},
 {'Asociación': 'AMPA EMILIO CASADO',
  'Actividad Subvencionada': 'INTERCENTROS ATLETISMO',
  'Importe en euros': '175.00 '},
 {'Asociación': 'AMPA FEDERICO GARCIA LORCA',
  'Actividad Subvencionada': 'DIA DEL LIBRO',
  'Importe en euros': '1.400.00 '},
 {'Asociación': 'AMPA FEDERICO GARCIA LORCA',
  'Actividad Subvencionada': 'TALLERES DE HALLOWEEN Y ADORNOS NAVIDAD',
  'Importe en euros': '85.00 '},
 {'Asociación': 'AMPA FEDERICO GARCIA LORCA',
  'Actividad Subvencionada': 'FIESTA FIN DE CURSO',
  'Importe en euros': '434.06 '},
 {'Asociación': 'AMPA GABRIEL Y GALAN',
  'Actividad Subvencionada': 'EXCURSIONES',
  'Importe en euros': '1.151.51 '},
 {'Asociación': 'AMPA GABRIEL Y GALAN',
  'Actividad Subvencionada': 'HUERTO ESCOLAR',
  'Importe en euros': '80.00 '},
 {'Asociación': 'AMPA GABRIEL Y GALAN',
  'Actividad Subvencionada': 'CUENTACUENTOS',
  'Importe en euros': '200.00 '},
 {'Asociación': 'AMPA GABRIEL Y GALAN',
  'Actividad Subvencionada': 'TALLER NAVIDEÑO',
  'Importe en euros': '120.00 '},
 {'Asociación': 'AMPA GABRIEL Y GALAN',
  'Actividad Subvencionada': 'FIESTA FIN DE CURSO',
  'Importe en euros': '480.00 '},
 {'Asociación': 'AMPA GABRIEL Y GALAN',
  'Actividad Subvencionada': 'PERIODICO',
  'Importe en euros': '160.00 '},
 {'Asociación': 'AMPA GABRIEL Y GALAN',
  'Actividad Subvencionada': 'CARNAVAL',
  'Importe en euros': '350.00 '},
 {'Asociación': 'AMPA GABRIEL Y GALAN',
  'Actividad Subvencionada': 'SAN ISIDRO',
  'Importe en euros': '200.00 '},
 {'Asociación': 'AMPA LUIS BUÑUEL',
  'Actividad Subvencionada': 'CONCURSO FELICITACIONES DE NAVIDAD',
  'Importe en euros': '90.00 '},
 {'Asociación': 'AMPA LUIS BUÑUEL',
  'Actividad Subvencionada': 'MERCADILLO NAVIDEÑO',
  'Importe en euros': '90.00 '},
 {'Asociación': 'AMPA LUIS BUÑUEL',
  'Actividad Subvencionada': 'GRADUACION',
  'Importe en euros': '440.00 '},
 {'Asociación': 'AMPA LUIS BUÑUEL',
  'Actividad Subvencionada': 'FIESTA FIN DE CURSO',
  'Importe en euros': '55.00 '},
 {'Asociación': 'AMPA LUIS BUÑUEL',
  'Actividad Subvencionada': 'PARTICIPACION FAPA ALCOBENDAS Y FAPA GINER DE LOS RIOS',
  'Importe en euros': '227.00 '},
 {'Asociación': 'AMPA LUIS BUÑUEL',
  'Actividad Subvencionada': 'FIESTA NAVIDAD',
  'Importe en euros': '625.00 '},
 {'Asociación': 'AMPA LUIS BUÑUEL',
  'Actividad Subvencionada': 'SAN ISIDRO',
  'Importe en euros': '200.00 '},
 {'Asociación': 'AMPA LUIS BUÑUEL',
  'Actividad Subvencionada': 'FIESTA DE HALLOWEEN',
  'Importe en euros': '80.00 '},
 {'Asociación': 'AMPA LUIS BUÑUEL',
  'Actividad Subvencionada': 'CASTAÑADA',
  'Importe en euros': '65.00 '},
 {'Asociación': 'AMPA LUIS BUÑUEL',
  'Actividad Subvencionada': 'CARNAVAL EN LAS AULAS: MERCADILLO MEDIEVAL',
  'Importe en euros': '209.00 '},
 {'Asociación': 'AMPA MIGUEL HERNANDEZ',
  'Actividad Subvencionada': 'CERTAMEN LITERARIO Y DE DIBUJO',
  'Importe en euros': '300.00 '},
 {'Asociación': 'AMPA MIGUEL HERNANDEZ',
  'Actividad Subvencionada': 'SEMANA CULTURAL',
  'Importe en euros': '153.00 '},
 {'Asociación': 'AMPA MIGUEL HERNANDEZ',
  'Actividad Subvencionada': 'EXCURSION A MADRID',
  'Importe en euros': '504.00 '},
 {'Asociación': 'AMPA MIGUEL HERNANDEZ',
  'Actividad Subvencionada': 'EXCURSION A SIERRA DE GUADARRAMA',
  'Importe en euros': '293.00 '},
 {'Asociación': 'AMPA MIGUEL HERNANDEZ',
  'Actividad Subvencionada': 'CONCURSO DE TARJETAS NAVIDEÑAS',
  'Importe en euros': '150.00 '},
 {'Asociación': 'AMPA MIGUEL HERNANDEZ',
  'Actividad Subvencionada': 'PARTICIPACION FESTIVAL FAPA',
  'Importe en euros': '12.00 '},
 {'Asociación': 'AMPA MIGUEL HERNANDEZ',
  'Actividad Subvencionada': 'FESTIVAL FIN CURSO',
  'Importe en euros': '287.00 '},
 {'Asociación': 'AMPA MIGUEL HERNANDEZ',
  'Actividad Subvencionada': 'ENTREGA DE ORLAS 3º INFANTIL',
  'Importe en euros': '100.00 '},
 {'Asociación': 'AMPA MIGUEL HERNANDEZ',
  'Actividad Subvencionada': 'PARTICIPACION EN FEDERACIONES',
  'Importe en euros': '80.00 '},
 {'Asociación': 'AMPA MIGUEL HERNANDEZ',
  'Actividad Subvencionada': 'VISITA REYES MAGOS',
  'Importe en euros': '530.00 '},
 {'Asociación': 'AMPA MIGUEL HERNANDEZ',
  'Actividad Subvencionada': 'FIESTA NAVIDAD',
  'Importe en euros': '475.00 '},
 {'Asociación': 'AMPA MIGUEL HERNANDEZ',
  'Actividad Subvencionada': 'TORNEOS DEPORTIVOS',
  'Importe en euros': '39.35 '},
 {'Asociación': 'AMPA MIRAFLORES',
  'Actividad Subvencionada': 'SALIDA CULTURAL SAFARI',
  'Importe en euros': '1.500.00 '},
 {'Asociación': 'AMPA MIRAFLORES',
  'Actividad Subvencionada': 'FIESTA FIN DE CURSO',
  'Importe en euros': '560.00 '},
 {'Asociación': 'AMPA MIRAFLORES',
  'Actividad Subvencionada': 'CUENTOS EN MIRAFLORES',
  'Importe en euros': '400.00 '},
 {'Asociación': 'AMPA MIRAFLORES',
  'Actividad Subvencionada': 'FIESTA DE NAVIDAD',
  'Importe en euros': '327.21 '},
 {'Asociación': 'AMPA PARQUE CATALUÑA',
  'Actividad Subvencionada': 'CONCURSO DE TARJETAS NAVIDEÑAS',
  'Importe en euros': '290.00 '},
 {'Asociación': 'AMPA PARQUE CATALUÑA',
  'Actividad Subvencionada': 'FUTBOL',
  'Importe en euros': '95.00 '},
 {'Asociación': 'AMPA PARQUE CATALUÑA',
  'Actividad Subvencionada': 'MULTIDEPORTE',
  'Importe en euros': '400.00 '},
 {'Asociación': 'AMPA PARQUE CATALUÑA',
  'Actividad Subvencionada': 'GRADUACIÓN',
  'Importe en euros': '130.00 '},
 {'Asociación': 'AMPA PARQUE CATALUÑA',
  'Actividad Subvencionada': 'FIESTA FIN DE CURSO',
  'Importe en euros': '995.00 '},
 {'Asociación': 'AMPA PARQUE CATALUÑA',
  'Actividad Subvencionada': 'PARTICIPACIÓN FAPA',
  'Importe en euros': '64.00 '},
 {'Asociación': 'AMPA PARQUE CATALUÑA',
  'Actividad Subvencionada': 'NAVIDAD',
  'Importe en euros': '455.00 '},
 {'Asociación': 'AMPA PARQUE CATALUÑA',
  'Actividad Subvencionada': 'DIA DEL LIBRO',
  'Importe en euros': '175.44 '},
 {'Asociación': 'AMPA PROFESOR TIERNO GALVÁN',
  'Actividad Subvencionada': 'FIESTA FIN DE CURSO',
  'Importe en euros': '300.00 '},
 {'Asociación': 'AMPA PROFESOR TIERNO GALVÁN',
  'Actividad Subvencionada': 'FAPA',
  'Importe en euros': '80.00 '},
 {'Asociación': 'AMPA PROFESOR TIERNO GALVÁN',
  'Actividad Subvencionada': 'DIA DEL LIBRO',
  'Importe en euros': '306.00 '},
 {'Asociación': 'AMPA PROFESOR TIERNO GALVÁN',
  'Actividad Subvencionada': 'DIA DE SAN ISIDRO',
  'Importe en euros': '100.00 '},
 {'Asociación': 'AMPA PROFESOR TIERNO GALVÁN',
  'Actividad Subvencionada': 'CONCURSO DE CHRISTMAS',
  'Importe en euros': '250.00 '},
 {'Asociación': 'AMPA PROFESOR TIERNO GALVÁN',
  'Actividad Subvencionada': 'FIESTA NAVIDAD',
  'Importe en euros': '250.00 '},
 {'Asociación': 'AMPA SEIS DE DICIEMBRE',
  'Actividad Subvencionada': 'EXCURSION GRANJA TALAMANCA',
  'Importe en euros': '476.00 '},
 {'Asociación': 'AMPA SEIS DE DICIEMBRE',
  'Actividad Subvencionada': 'NAVIDAD',
  'Importe en euros': '320.00 '},
 {'Asociación': 'AMPA SEIS DE DICIEMBRE',
  'Actividad Subvencionada': 'CUENTACUENTOS AMBIENTALES',
  'Importe en euros': '280.00 '},
 {'Asociación': 'AMPA SEIS DE DICIEMBRE',
  'Actividad Subvencionada': 'FIN DE CURSO',
  'Importe en euros': '256.00 '},
 {'Asociación': 'AMPA SEIS DE DICIEMBRE',
  'Actividad Subvencionada': 'FESTIVAL FIN DE CURSO',
  'Importe en euros': '100.00 '},
 {'Asociación': 'AMPA SEIS DE DICIEMBRE',
  'Actividad Subvencionada': 'AGENDA ESCOLAR',
  'Importe en euros': '518.00 '},
 {'Asociación': 'AMPA VALDEPALITOS',
  'Actividad Subvencionada': 'VISITA MUSEO DEL VIDRIO',
  'Importe en euros': '385.50 '},
 {'Asociación': 'AMPA VALDEPALITOS',
  'Actividad Subvencionada': 'SALIDAS CULTURALES EN FAMILIA',
  'Importe en euros': '490.00 '},
 {'Asociación': 'AMPA VALDEPALITOS',
  'Actividad Subvencionada': 'TALLER EXTRAESCOLAR DISFRACES',
  'Importe en euros': '190.00 '},
 {'Asociación': 'AMPA VALDEPALITOS',
  'Actividad Subvencionada': 'TALLER EXTRAESCOLAR DANZA ESPAÑOLA',
  'Importe en euros': '190.00 '},
 {'Asociación': 'AMPA VALDEPALITOS',
  'Actividad Subvencionada': 'TALLER EXTRAESCOLAR DANZA MODERNA',
  'Importe en euros': '90.00 '},
 {'Asociación': 'AMPA VALDEPALITOS',
  'Actividad Subvencionada': 'FIESTA FIN DE CURSO',
  'Importe en euros': '690.00 '},
 {'Asociación': 'AMPA VALDEPALITOS',
  'Actividad Subvencionada': 'FESTIVAL DANZA Y TEATRO',
  'Importe en euros': '210.00 '},
 {'Asociación': 'AMPA VALDEPALITOS',
  'Actividad Subvencionada': 'CEREMONIA GRADUACION 6º PRIMARIA',
  'Importe en euros': '170.00 '},
 {'Asociación': 'AMPA VALDEPALITOS',
  'Actividad Subvencionada': 'ORLA PARA 6º PRIMARIA',
  'Importe en euros': '110.00 '},
 {'Asociación': 'AMPA VALDEPALITOS',
  'Actividad Subvencionada': 'CEREMONIA GRADUACION INFANTIL',
  'Importe en euros': '180.00 '},
 {'Asociación': 'AMPA VALDEPALITOS',
  'Actividad Subvencionada': 'BOLETIN APA',
  'Importe en euros': '260.00 '},
 {'Asociación': 'AMPA VALDEPALITOS',
  'Actividad Subvencionada': 'PARTICIPACION FAPA ALCOBENDAS',
  'Importe en euros': '64.00 '},
 {'Asociación': 'AMPA VALDEPALITOS',
  'Actividad Subvencionada': 'PARTICIPACION FESTIVAL FAPA',
  'Importe en euros': '260.00 '},
 {'Asociación': 'AMPA VALDEPALITOS',
  'Actividad Subvencionada': 'PARTICIPACION FAPA GINER DE LOS RIOS',
  'Importe en euros': '160.00 '},
 {'Asociación': 'AMPA VALDEPALITOS',
  'Actividad Subvencionada': 'FIESTA DE NAVIDAD',
  'Importe en euros': '180.00 '},
 {'Asociación': 'AMPA VALDEPALITOS',
  'Actividad Subvencionada': 'TORNEO MULTIDEPORTE',
  'Importe en euros': '120.00 '},
 {'Asociación': 'AMPA VALDEPALITOS',
  'Actividad Subvencionada': 'SEMANA CULTURAL',
  'Importe en euros': '180.00 '},
 {'Asociación': 'AMPA LA CHOPERA',
  'Actividad Subvencionada': 'SEMANA DEL LIBRO',
  'Importe en euros': '990.00 '},
 {'Asociación': 'AMPA LA CHOPERA',
  'Actividad Subvencionada': 'TALLER DE MUSICA',
  'Importe en euros': '120.00 '},
 {'Asociación': 'AMPA LA CHOPERA',
  'Actividad Subvencionada': 'FIESTA GRADUACION',
  'Importe en euros': '320.00 '},
 {'Asociación': 'AMPA EL CUQUILLO',
  'Actividad Subvencionada': 'SEMANA DEL LIBRO',
  'Importe en euros': '610.00 '},
 {'Asociación': 'AMPA EL CUQUILLO',
  'Actividad Subvencionada': 'DIA DE LA INFANCIA',
  'Importe en euros': '150.00 '},
 {'Asociación': 'AMPA EL CUQUILLO',
  'Actividad Subvencionada': 'FIESTA FIN DE CURSO Y GRADUACION',
  'Importe en euros': '368.00 '},
 {'Asociación': 'AMPA EL CUQUILLO',
  'Actividad Subvencionada': 'FIESTA NAVIDAD',
  'Importe en euros': '379.83 '},
 {'Asociación': 'AMPA VALDELAPARRA',
  'Actividad Subvencionada': 'SEMANA DEL LIBRO Y FERIA DEL LIBRO',
  'Importe en euros': '685.00 '},
 {'Asociación': 'AMPA VALDELAPARRA',
  'Actividad Subvencionada': 'EL HUERTO',
  'Importe en euros': '70.00 '},
 {'Asociación': 'AMPA VALDELAPARRA',
  'Actividad Subvencionada': 'TALLER DEL NIDO',
  'Importe en euros': '95.00 '},
 {'Asociación': 'AMPA VALDELAPARRA',
  'Actividad Subvencionada': 'FIESTA GRADUACION',
  'Importe en euros': '670.00 '},
 {'Asociación': 'AMPA VALDELAPARRA',
  'Actividad Subvencionada': 'QUERIDOS REYES MAGOS',
  'Importe en euros': '590.00 '},
 {'Asociación': 'AMPA VALDELAPARRA',
  'Actividad Subvencionada': 'FERIA DE LAS ASOCIACIONES',
  'Importe en euros': '150.00 '},
 {'Asociación': 'AMPA VALDELAPARRA',
  'Actividad Subvencionada': 'SAN ISIDRO',
  'Importe en euros': '205.00 '},
 {'Asociación': 'AMPA RIVENDEL',
  'Actividad Subvencionada': 'DIA DE LA PAZ',
  'Importe en euros': '230.00 '},
 {'Asociación': 'AMPA RIVENDEL',
  'Actividad Subvencionada': 'SEMANA CULTURAL Y DIA DEL LIBRO',
  'Importe en euros': '794.00 '},
 {'Asociación': 'AMPA RIVENDEL',
  'Actividad Subvencionada': 'VISITA GRANJA ESCUELA',
  'Importe en euros': '115.00 '},
 {'Asociación': 'AMPA RIVENDEL',
  'Actividad Subvencionada': 'FIESTA FIN DE CURSO',
  'Importe en euros': '700.00 '},
 {'Asociación': 'AMPA RIVENDEL',
  'Actividad Subvencionada': 'PERTENENCIA A LA FAPA',
  'Importe en euros': '64.00 '},
 {'Asociación': 'AMPA RIVENDEL',
  'Actividad Subvencionada': 'CARNAVAL',
  'Importe en euros': '157.00 '},
 {'Asociación': 'AMPA RIVENDEL',
  'Actividad Subvencionada': 'BELEN NAVIDEÑO',
  'Importe en euros': '40.00 '},
 {'Asociación': 'AMPA RIVENDEL',
  'Actividad Subvencionada': 'FIESTA DE NAVIDAD',
  'Importe en euros': '100.00 '},
 {'Asociación': 'AMPA AGORA',
  'Actividad Subvencionada': 'PREMIOS AL RENDIMIENTO. SUPERACIÓN Y CONVICENCIA',
  'Importe en euros': '501.67 '},
 {'Asociación': 'AMPA AGORA',
  'Actividad Subvencionada': 'ANIMACION A LA LECTURA',
  'Importe en euros': '560.00 '},
 {'Asociación': 'AMPA AGORA',
  'Actividad Subvencionada': 'SALIDA AL TEATRO',
  'Importe en euros': '240.00 '},
 {'Asociación': 'AMPA AGORA',
  'Actividad Subvencionada': 'EXCURSION CULTURAL VISITA CORRALAS DE MADRID',
  'Importe en euros': '120.00 '},
 {'Asociación': 'AMPA AGORA',
  'Actividad Subvencionada': 'CONCURSO FOTOGRAFICO CONSTITUCION',
  'Importe en euros': '160.00 '},
 {'Asociación': 'AMPA AGORA',
  'Actividad Subvencionada': 'ACTO DE GRADUACIÓN',
  'Importe en euros': '300.00 '},
 {'Asociación': 'AMPA AGORA',
  'Actividad Subvencionada': 'INTERCAMBIO DE LIBROS DE TEXTO',
  'Importe en euros': '80.00 '},
 {'Asociación': 'AMPA AGORA',
  'Actividad Subvencionada': 'JORNADA DE CONVIVENCIA',
  'Importe en euros': '250.00 '},
 {'Asociación': 'AMPA AGORA',
  'Actividad Subvencionada': 'MILLA ESCOLAR',
  'Importe en euros': '210.00 '},
 {'Asociación': 'AMPA ALDEBARAN',
  'Actividad Subvencionada': 'PREMIOS AL RENDIMIENTO. SUPERACIÓN Y CONVIVENCIA',
  'Importe en euros': '980.05 '},
 {'Asociación': 'AMPA ALDEBARAN',
  'Actividad Subvencionada': 'ANIMACION A LA LECTURA',
  'Importe en euros': '302.00 '},
 {'Asociación': 'AMPA ALDEBARAN',
  'Actividad Subvencionada': 'PRACTICANDO IDIOMAS',
  'Importe en euros': '278.00 '},
 {'Asociación': 'AMPA ALDEBARAN',
  'Actividad Subvencionada': 'CONCURSO DE TARJETAS NAVIDEÑAS',
  'Importe en euros': '190.00 '},
 {'Asociación': 'AMPA ALDEBARAN',
  'Actividad Subvencionada': 'GRADUACION ALUMNOS BACHILLER',
  'Importe en euros': '220.00 '},
 {'Asociación': 'AMPA ALDEBARAN',
  'Actividad Subvencionada': 'BOLETIN INFORMATIVO',
  'Importe en euros': '587.00 '},
 {'Asociación': 'AMPA ALDEBARAN',
  'Actividad Subvencionada': 'PARTICIPACION EN FAPAS',
  'Importe en euros': '260.00 '},
 {'Asociación': 'AMPA ALDEBARAN',
  'Actividad Subvencionada': 'TALLER CHAPAS E IMANES',
  'Importe en euros': '290.00 '},
 {'Asociación': 'AMPA GINER DE LOS RIOS',
  'Actividad Subvencionada': 'CERTAMEN TARJETA NAVIDAD',
  'Importe en euros': '673.00 '},
 {'Asociación': 'AMPA GINER DE LOS RIOS',
  'Actividad Subvencionada': 'CERTAMEN DE RELATO Y POESIA',
  'Importe en euros': '320.00 '},
 {'Asociación': 'AMPA GINER DE LOS RIOS',

In [85]:
df_json=pd.DataFrame(datos)

In [86]:
df_json.head()

             Asociación    Actividad Subvencionada Importe en euros
0  AMPA ANTONIO MACHADO  TALLER FIESTA DE CARNAVAL            94.56
1  AMPA ANTONIO MACHADO       TALLER DIA DEL PADRE           39.04
2  AMPA ANTONIO MACHADO     TALLER DIA DE LA MADRE           43.64
3  AMPA ANTONIO MACHADO        FIESTA FIN DE CURSO          921.00
4  AMPA ANTONIO MACHADO     CONCURSO LOGOTIPO AMPA           56.57

**Excel**

In [88]:
df_excel = pd.read_excel("subvenciones_df.xls",
                        sheet_name="Hoja1")

In [89]:
df_excel.head()

   Unnamed: 0            Asociación   Actividad Subvencionada   Importe
0           0  AMPA ANTONIO MACHADO  TALLER FIESTA DE CARNAVAL    94.56
1           1  AMPA ANTONIO MACHADO       TALLER DIA DEL PADRE    39.04
2           2  AMPA ANTONIO MACHADO     TALLER DIA DE LA MADRE    43.64
3           3  AMPA ANTONIO MACHADO        FIESTA FIN DE CURSO   921.00
4           4  AMPA ANTONIO MACHADO     CONCURSO LOGOTIPO AMPA    56.57

**SPSS**

In [90]:
df_spss, meta=pyreadstat.read_sav("distritos.sav")

In [92]:
df_spss.head(10)

,distrito,ocu_vivi,pobpjov,sinelect,sinagua,pea1619,pocprin,peam15
0,Ate,1.15,5.3,27.60,51.10,3.9,1.1,63.48
1,Barranco,1.09,4.5,1.59,8.32,0.8,3.9,33.48
2,Breña,1.08,4.4,2.20,23.15,0.9,4.0,37.89
3,Carabayllo,1.10,5.1,30.13,38.09,4.5,12.6,63.65
4,Comas,1.20,5.9,10.92,24.27,3.8,9.4,60.37
5,Chorrillos,1.15,5.5,16.77,37.11,3.2,10.6,18.78
6,Agustino,1.22,6.0,16.42,41.16,4.5,13.5,55.84
7,Independencia,1.19,5.9,9.61,21.58,4.0,10.5,60.16
8,Jesús María,1.03,4.2,0.57,14.78,0.3,3.1,23.52
9,La Victoria,1.06,4.7,3.09,25.79,1.7,7.8,49.21

**STATA**

In [93]:
df_stata = pd.read_stata("anes_timeseries_2012.dta")

In [94]:
len(df_stata)

5914

In [95]:
df_stata.head()

,version,caseid,weight_ftf,weight_web,weight_full,psu_full,psu_ftf,strata_full,strata_ftf,ftf_oversample,...,randordq_casitherm_illegal,randordq_casitherm_white,randordq_stereogroups,randordq_discrim_black,randordq_discrim_hisp,randordq_discrim_white,randordq_discrim_gay,randordq_discrim_women,randordq_stereorelig,invited_inetrecontact2013
0,ANES2012TimeSeries_version20150528,1.0,0.3802,0.0,0.3802,1.0,1.0,6.0,6.0,0. No oversample,...,"-6. Not asked, unit nonresponse (no post-elect...","-6. Not asked, unit nonresponse (no post-elect...","-6. Not asked, unit nonresponse (no post-elect...","-6. Not asked, unit nonresponse (no post-elect...","-6. Not asked, unit nonresponse (no post-elect...","-6. Not asked, unit nonresponse (no post-elect...","-6. Not asked, unit nonresponse (no post-elect...","-6. Not asked, unit nonresponse (no post-elect...","-1. Inap, FTF (face-to-face) interview","-1. Inap, FTF"
1,ANES2012TimeSeries_version20150528,2.0,0.5470,0.0,0.5470,1.0,1.0,6.0,6.0,0. No oversample,...,5. 5th CASI/Web group thermometer,3. 3rd CASI/Web group thermometer,"231. Order: 2 (Hispanics), 3 (Asians), 1 (Blacks)",3. 3rd discrimination group,1. 1st discrimination group,5. 5th discrimination group,2. 2nd discrimination group,4. 4th discrimination group,"-1. Inap, FTF (face-to-face) interview","-1. Inap, FTF"
2,ANES2012TimeSeries_version20150528,3.0,0.4975,0.0,0.4975,1.0,1.0,6.0,6.0,0. No oversample,...,5. 5th CASI/Web group thermometer,4. 4th CASI/Web group thermometer,"132. Order: 1 (Blacks), 3 (Asians), 2 (Hispanics)",-2. Missing,-2. Missing,-2. Missing,-2. Missing,-2. Missing,"-1. Inap, FTF (face-to-face) interview","-1. Inap, FTF"
3,ANES2012TimeSeries_version20150528,4.0,0.2549,0.0,0.2549,1.0,1.0,6.0,6.0,0. No oversample,...,5. 5th CASI/Web group thermometer,3. 3rd CASI/Web group thermometer,"213. Order: 2 (Hispanics), 1 (Blacks), 3 (Asians)",3. 3rd discrimination group,2. 2nd discrimination group,5. 5th discrimination group,1. 1st discrimination group,4. 4th discrimination group,"-1. Inap, FTF (face-to-face) interview","-1. Inap, FTF"
4,ANES2012TimeSeries_version20150528,5.0,0.6028,0.0,0.6028,1.0,1.0,6.0,6.0,0. No oversample,...,5. 5th CASI/Web group thermometer,1. 1st CASI/Web group thermometer,"312. Order: 3 (Asians), 1 (Blacks), 2 (Hispanics)",-2. Missing,-2. Missing,-2. Missing,-2. Missing,-2. Missing,"-1. Inap, FTF (face-to-face) interview","-1. Inap, FTF"

**CSV**

In [103]:
df_csv = pd.read_csv("subvenciones.csv", 
                     sep=",",
                    encoding="latin1")

In [104]:
df_csv

,Asociación,Actividad Subvencionada,Importe
0,AMPA ANTONIO MACHADO,TALLER FIESTA DE CARNAVAL,94.56
1,AMPA ANTONIO MACHADO,TALLER DIA DEL PADRE,39.04
2,AMPA ANTONIO MACHADO,TALLER DIA DE LA MADRE,43.64
3,AMPA ANTONIO MACHADO,FIESTA FIN DE CURSO,921.00
4,AMPA ANTONIO MACHADO,CONCURSO LOGOTIPO AMPA,56.57
...,...,...,...
186,AMPA PADRE MANYANET,FERIA DE ROBOTICA,720.00
187,AMPA PADRE MANYANET,LUDOTECA FIESTA FIN DE CURSO,372.00
188,AMPA FAPA,JORNADA FAPA-APAS: ENCUENTROS DE PARTICIPACION,720.00
189,AMPA FAPA,25 ANIVERSARIO FAPA ALCOBENDAS,1515.00
190,AMPA FAPA,"REVISTA DE LA FEDERACION ""LA ESCUELA EN ALCOBE...",963.43

**TXT**

In [105]:
df_txt = pd.read_csv("housing.data.txt",
                     header=None
                    sep="\s+")

In [106]:
df_txt.head()

,0.00632,18.00,2.310,0,0.5380,6.5750,65.20,4.0900,1,296.0,15.30,396.90,4.98,24.00
0,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
1,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
2,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
3,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2
4,0.02985,0.0,2.18,0,0.458,6.430,58.7,6.0622,3,222.0,18.7,394.12,5.21,28.7

**Conexión a motores de bases de datos**

In [74]:
import pandas.io.sql
import pyodbc # conexión a SQL Server por odbc
import psycopg2 #conexión a PostgreSQL

**SQL Server**

**PostgreSQL**

**Web Scraping**

**Conexión mediante API**